# Pandas

In [15]:
import pandas as pd

def build_df():
    table = [[1 , 2, 3, 10], [3, 4, 8, 0], [1, 2, 3, 4]]
    df = pd.DataFrame(table)
    df = df.transpose()
    df.columns = ['order_id', 'cost', 'product_id']
    return df

def build_products_df():
    table = [[1, 2, 3, 4, 5], ['Letter size paper', 'Glazed Donuts', '5kWh Battery', 'Screwdriver', 'Pen']]
    df = pd.DataFrame(table)
    df = df.transpose()
    df.columns = ['product_id', 'product_name']
    return df

In [5]:
orders = build_df()
orders

   order_id  cost  product_id
0         1     3           1
1         2     4           2
2         3     8           3
3        10     0           4

In [17]:
products = build_products_df()
products

  product_id       product_name
0          1  Letter size paper
1          2      Glazed Donuts
2          3       5kWh Battery
3          4        Screwdriver
4          5                Pen

In [6]:
# Get column by column name
orders.order_id

0     1
1     2
2     3
3    10
Name: order_id, dtype: int64

In [8]:
# Use indexing to get specific record and column
orders['order_id'][1]

2

In [9]:
# Get first record
orders.iloc[0]

order_id      1
cost          3
product_id    1
Name: 0, dtype: int64

In [10]:
# Get all records from first column
orders.iloc[:, 0]

0     1
1     2
2     3
3    10
Name: order_id, dtype: int64

In [12]:
# Get first 3 records from first column
orders.iloc[:3, 0]

0    1
1    2
2    3
Name: order_id, dtype: int64

In [13]:
# Get third and fourth entries
orders.iloc[2:4, 0]

2     3
3    10
Name: order_id, dtype: int64

In [14]:
# Get last 2 records
orders.iloc[-2:]

   order_id  cost  product_id
2         3     8           3
3        10     0           4

In [18]:
# Use loc to get first value of column
products.loc[0, 'product_name']

'Letter size paper'

In [19]:
# Conditional filtering
orders.cost == 0

0    False
1    False
2    False
3     True
Name: cost, dtype: bool

In [20]:

orders.loc[orders.cost == 0]

   order_id  cost  product_id
3        10     0           4

In [23]:
orders.loc[(orders.cost == 0) | (orders.cost < 5)]

   order_id  cost  product_id
0         1     3           1
1         2     4           2
3        10     0           4

In [24]:
# Filter by list of names
products.loc[products.product_name.isin(['Screwdriver'])]

  product_id product_name
3          4  Screwdriver

In [25]:
# Filter by not null
products.loc[products.product_name.notnull()]

  product_id       product_name
0          1  Letter size paper
1          2      Glazed Donuts
2          3       5kWh Battery
3          4        Screwdriver
4          5                Pen

In [28]:
# Assign Data to a column
products['offer'] = None
products

  product_id       product_name offer
0          1  Letter size paper  None
1          2      Glazed Donuts  None
2          3       5kWh Battery  None
3          4        Screwdriver  None
4          5                Pen  None

In [29]:
# Map function
orders_mean = orders.cost.mean()
orders.cost.map(lambda p: p - orders_mean)

0   -0.75
1    0.25
2    4.25
3   -3.75
Name: cost, dtype: float64

In [31]:
orders['substract_mean'] = orders.cost.map(lambda p: p - orders_mean)
orders

   order_id  cost  product_id  substract_mean
0         1     3           1           -0.75
1         2     4           2            0.25
2         3     8           3            4.25
3        10     0           4           -3.75

In [33]:
orders_with_products = pd.merge(orders, products, how='left', on='product_id')
orders_with_products

   order_id  cost product_id  substract_mean       product_name offer
0         1     3          1           -0.75  Letter size paper  None
1         2     4          2            0.25      Glazed Donuts  None
2         3     8          3            4.25       5kWh Battery  None
3        10     0          4           -3.75        Screwdriver  None